# **Pandas Exercise**

1. Connect to the database using SQLite3 Module.
2. Import all the data from SQLite Database into a DataFrame

In [3]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("pandas_exercise.db")
pandas_exercise_df = pd.read_sql_query("SELECT * FROM employee", conn)
pandas_exercise_df

     employee_id first_name  last_name       department salary
0              1       John        Doe            Sales  50000
1              2       Jane                   Marketing  60000
2              3    Michael    Johnson       Operations  55000
3              4                 Brown  Human Resources  58000
4              5    William      Jones            Sales  52000
..           ...        ...        ...              ...    ...
104          105     Carson     Flores            Sales  75000
105          106      Naomi       Reed        Marketing  85000
106          107      Jaxon   Gonzalez       Operations  80000
107          108    Paisley  Hernandez  Human Resources  82000
108          109     Robert                       Sales

[109 rows x 5 columns]

### **Data Cleaning**

3. Count how many cells are empty.

4. Count how many cells contains empty values represented with ''.

5. Replace the empty values that is represented with '' with the proper represetation of null which is NA.

6. Confirm if the empty cells are now replaced with the correct representation of null.

7. Delete the rows/records that contain null values.

8. Confirm if the rows/records that contain null values have been deleted.

9. Count how many rows/records are duplicated.

Hint: Keep in mind that we have a `employee_id` column, which contains unique values for each row/record. 

This could affect the `df.duplicated().sum()` approach.

10. Delete the column that contains unique values that affects the `df.duplicated().sum()` approach.

11. Count how many rows/records are duplicated.

12. Remove the duplicated rows/records.

13. Check if the duplicated rows/records have been deleted.

14. Check the data type of each column.

15. Convert it to the right data type.

16. Check if the data type is correct.

### `Task 1:` Filter all the employee from the Operations department that have the salary greater than 70,000

### `Task 2:` Filter all the employee from the Human Resources department that have the salary less than 65,000

### `Task 3:` Calculate the total employee for each department

### `Task 4:` Calculate average salary per department

### `Task 5:` Calculate maximum salary per department

### `Task 6:` Calculate manimum salary per department

### `Task 7:` Create a report that list all of the information that you gathered from the data provided.